%ЗАВДАННЯ №1%
x1=((12+1/6-6-1/27-5.25)*13.5+0.111)/0.02
%ЗАВДАННЯ №2%
help elfun
help datafun 
help graph2d

%ЗАВДАННЯ №3, приклад №1%
r=1;
sprintf ('Радіус r=%4.2f м; Довжина окружності L=%4.3f м',r,2*pi*r)
fprintf ('Радіус r=%4.2f м; Довжина окружності L=%4.3f м',r,2*pi*r)
r1=[1 2 3]
fprintf ('Радіус r=%4.2f м; Довжина окружності L=%4.3f м',r,2*pi*r)
%ЗАВДАННЯ №4, приклад №4%
m1=-14/5
n1=tan(pi/18)
x2=3*m1^2+((n1^2)^(1/3))/m1

m2=2.2*10^(-2)
n2=1/3.1
x3=3*m2^2+((n2^2)^(1/3))/m2